{
  "global": {
    "app": "Edu SHEPOT"
  },
  "ru.midoritroop.frames.MainMenuFrame": {
    "mainMenuDesc": "<html>Автоматизированный комплекс<br>для проведения акустических<br>и виброакустических измерений<br>''ШЕПОТ''</html>",
    "review": "Обзор",
    "contents": "Состав",
    "struct": "Структура",
    "study": "Обучение",
    "help": "Справка",
    "exit": "Выход"
  },
  "ru.midoritroop.frames.StructFrame": {
    "slide1Name": "Структура",
    "slide2Name": "Измерительный микрофон",
    "slide3Name": "Акустический излучатель",
    "slide4Name": "Генератор шума",
    "slide5Name": "Средство измерения помех",

    "slide1Desc": "<html>На данном рисунке изображена схема работы комплекса при акустических и виброакустических измерениях.<br><br>Нажмите на элемент комплекса для получения большей информации о нем.</html>",
    "slide2Desc": "<html>Для измерений комплекса «Шепот» используются два измерительных PCB микрофона. Далее дана структурная схема работы микрофона такого типа.</html>",
    "slide3Desc": "<html>Для создания звука подаваемого от генератора шума, акустический излучатель синтезирует получаемые сигналы, используя цифроаналоговое преобразование. Далее даны схемы работы цифроаналогового преобразования и синтезирования звука для его дальнейшего воспроизведения излучателем.</html>",
    "slide3Desc1": "<html>«Схема цифроаналогового преобразования»</html>",
    "slide3Desc2": "<html>«Схема синтезатора»</html>",
    "slide4Desc": "<html>В комплекте «Шепот» поставляется генератор шума «Шорох-2МИ». Далее дана структурная схема генератора шума</html>",
    "slide5Desc": "<html>В случае комплекса «Шепот» для измерения помех используется средство измерения «Larson&Davis 824». Его структурная схема</html>",

    "slide1H1": "<html>Измерительный микрофон</html>",
    "slide1H2": "<html>Акустический излучатель</html>",
    "slide1H3": "<html>Генератор шума</html>",
    "slide1H4": "<html>Средство измерения помех</html>",
    "slide1H5": "<html>Ограждающая конструкция, для которой проводятся измерения</html>",

    "slide2H1": "<html>Кабель</html>",
    "slide2H2": "<html>Питание</html>",
    "slide2H3": "<html>Заземление</html>",
    "slide2H4": "<html>Защитная оболочка кабеля</html>",
    "slide2H5": "<html>Источник питания</html>",
    "slide2H6": "<html>Одиночный аудио-канал</html>",
    "slide2H7": "<html>Микрофонная система</html>",
    "slide2H8": "<html>Параметры барьера:<br>Voc/Uo ≤ VMAX / UI<br>Isc/Io ≤ IMAX/ II <br>Ca/Co > CI + CCABLE<br>La/Lo > LI + LCABL<br>Ui = 30V, Ii = 100mA, Pi = 0.75W, Ci = 0, Li = 0.36uH – барьер серии EX378XYYY</html>",
    "slide2H9": "<html>Барьер устанавливается в корпусе, соответствующим стандартам властей данной страны</html>",
    "slide2H10": "<html>Защитные экраны заземляются на концах барьера</html>",
    "slide2H11": "<html>Утвержденный картридж для микрофона – картридж серии EX377XYYY</html>",
    "slide2H12": "<html>Утвержденный усилитель для микрофона – усилитель серии EX426XYYY</html>",

    "slide3H1": "<html>Дискретный по времени и значению сигнал с ошибками</html>",
    "slide3H2": "<html>Канальный декодер</html>",
    "slide3H3": "<html>Дискретный по времени и значению сигнал без ошибок</html>",
    "slide3H4": "<html>Декодер</html>",
    "slide3H5": "<html>Дискретный по значению сигнал</html>",
    "slide3H6": "<html>Сглаживание</html>",
    "slide3H7": "<html>Непрерывный сигнал</html>",
    "slide3H8": "<html>Фильтрация</html>",
    "slide3H9": "<html>На данном этапе из потока цифровых данных с помощью цифроаналогового преобразователя (ЦАП) выделяют отсчеты сигнала, следующие с частотой дискретизации</html>",
    "slide3H10": "<html>На данном этапе из дискретных отсчетов путем сглаживания (интерполяции) формируется непрерывный аналоговый сигнал с помощью фильтра низкой частоты, который подавляет периодические составляющие спектра дискретного сигнала</html>",
    "slide3H11": "<html>В случае комплекса «Шепот» - генератор шума</html>",
    "slide3H12": "<html>Сигнал возбуждения подается на фильтр, имитирующий необходимую амплитудно-частотную характеристику</html>",
    "slide3H13": "<html>На другой вход фильтра подается сигнал амплитудной огибающей, а совокупность сигналов обрабатывается с целью получения специальных звуковых эффектов, например, эха</html>",
    "slide3H14": "<html>Фильтрация сигнала с помощью фильтра низких частот</html>",
    "slide3H15": "<html>Генерирует ADSR огибающую - функцию, описывающую изменения какого-либо параметра во времени</html>",
    "slide3H16": "<html>Канальный декодер</html>",

    "slide4H1": "<html>Источник шумового сигнала, выполненный на резисторе</html>",
    "slide4H2": "<html>Повышает сигнал до уровня напряжения линейного входа</html>",
    "slide4H3": "<html>Пассивное сверхвысокочастотное устройство, которое изменяет и исправляет спектральные плотности сигнала</html>",
    "slide4H4": "<html>Маломощный генератор электрических колебаний, применяемый для преобразования частот сигнала, а данном случае источник опорного сигнала для перемножения</html>",
    "slide4H5": "<html>Переводит сигнал из области звуковых частот в радиочастоты</html>",
    "slide4H6": "<html>Усиливает мощность сигнала для его перенаправления на акустический излучатель</html>",

    "slide5H1": "<html>Микрофон и предусилитель</html>",
    "slide5H2": "<html>Коэффициент передачи от 0 до 50 дБ</html>",
    "slide5H3": "<html>Электронный или любой другой фильтр, пропускающий высокие частоты входного сигнала, при этом подавляя частоты сигнала ниже частоты среза. Степень подавления зависит от конкретного типа фильтра</html>",
    "slide5H4": "<html>Аналого-цифровой преобразователь - устройство, преобразующее входной аналоговый сигнал в дискретный код/цифровой сигнал</html>",
    "slide5H5": "<html>Цифровой процессор обработки сигналов - специализированный программируемый микропроцессор, предназначенный для манипулирования в реальном масштабе времени потоком цифровых данных</html>",
    "slide5H6": "<html>Внешнее питание</html>",
    "slide5H7": "<html>Подача переменного тока</html>",
    "slide5H8": "<html>Подача постоянного тока</html>",
    "slide5H9": "<html>Мультиплексор - позволяет передавать сигнал с одного из входов на выход; при этом выбор желаемого входа осуществляется подачей соответствующей комбинации управляющих сигналов</html>",
    "slide5H10": "<html>Выход постоянного и переменного тока</html>",
    "slide5H11": "<html>Контроллер ввода/вывода</html>",
    "slide5H12": "<html>RAM – оперативная память – от ½ до 2 МБ</html>",
    "slide5H13": "<html>Flash ROM - электрически-стираемая программируемая постоянная память</html>",
    "slide5H14": "<html>Календарь и счетчик реального времени</html>",
    "slide5H15": "<html>Серийный контроллер ввода/вывода - метод последовательной передачи элементов данных между устройствами</html>",
    "slide5H16": "<html>Графический жидкокристаллический экран 128х64 мм с подсветкой</html>",
    "slide5H17": "<html>Передатчик RS-422/232</html>",
    "slide5H18": "<html>Серийный контроллер ввода/вывода – метод последовательной передачи элементов данных между устройствами</html>"
  },
  "ru.midoritroop.frames.ReviewFrame": {
    "slide1Name": "Спрут-6МА",
    "slide2Name": "Спрут-7A",
    "slide3Name": "\"Колибри\"",
    "slide4Name": "<html>Система оценки защищенности выделенных помещений по виброакустическому каналу \"ШЕПОТ-Т\"</html>",

    "slide1Desc": "<html>Программно-аппаратный комплекс для проверки выполнения норм эффективности защиты речевой информации от утечки по акустическому, виброакустическому каналам, а также за счет низкочастотных наводок на токопроводящих элементах ограждающих конструкций и линиях ТСПИ за счет побочных электромагнитных излучений от технических средств в речевом диапазоне. Позволяет проводить измерение звуко- и виброизоляционных измерений конструкций исследования характеристик и проверку эффективности систем акустического и виброакустического зашумления; измерения уровней электрического и магнитного полей и наводок на проводные коммуникации; измерения характеристик акустических и виброакустических сигналов анализ и так далее.</center></html>",
    "slide2Desc": "<html>Программно-аппаратный комплекс для проверки выполнения норм эффективности защиты речевой информации от её утечки по акустическому и виброакустическому каналам, а также за счет низкочастотных наводок на токопроводящие элементы ограждающих конструкций зданий и сооружений и наводок от технических средств в речевом диапазоне частот, образованных за счет акусто-электрических преобразований. Управление комплексом осуществляется по радиоканалу. Комплекс использует измерительную подсистему на базе анализатора шума и вибраций 1-го класса точности SVAN-947 с двумя антеннами типа АИ 4-1 и АИР 3-1, а измерения происходят с использованием функции быстрого преобразования Фурье (БПФ).</html>",
    "slide3Desc": "<html>Программно-аппаратный комплекс для оценки эффективности защиты речевой информации по виброакустическим каналам, параметров акустических вибрационных и маломощных электрических сигналов и акустических свойств помещений. При решении задач по оценке эффективности защиты речевой информации комплекс позволяет проводить детальное исследование акустических и виброакустических каналов утечки речевой информации.</html>",
    "slide4Desc": "<html>В комплекте «Шепот» поставляется генератор шума «Шорох-2МИ». Далее дана структурная схема генератора шума</html>",

    "slide1H1": "<html>Виброакустический анализатор «СПРУТ-ВАА-1» (одноканальный шумомер – анализатор спектра – виброметр) предназначен для эстетической визуализации аудиосигнала, замеров спектра шумовых сигналов и общего анализа шумового, вибрационного и электрического полей.</html>",
    "slide1H2": "<html>Активная акустическая система со встроенным усилителем в экранированном контейнере АС-9 является двух полосной АС с фазоинвертором. Ее диапазон воспроизводимых частот 63-18000 Гц, чувствительность 85 дБ, сопротивление 4 Ом, а номинальная и максимальная мощность 10 и 25 Вт соответственно. Для АС в комплексе предполагается аудио кабель Jack 3,5 мм – Jack 3,5 мм и переходник Jack 3,5 мм – Jack 6,3 мм.</html>",
    "slide1H3": "<html>ПЭВМ, специализированно разработанная для дальнейшей работы на ней с соответствующей СПО для проведения измерений. В комплект «Спрут-6М» для этого входит СПО «Спрут»</html>",
    "slide1H4": "<html>Носитель информации на диске типа Flash с СПО «Спрут» - СПО, предназначенное для управления измерительным модулем и модулем источника тестового акустического сигнала, проведения измерений и получениях их результатов, их редактирования и сохранения для дальнейшего создания отчетов.</html>",
    "slide1H5": "<html>Внешний аккумулятор модуля радиоканала «SDA», предназначен для электропитания проверяемых устройств постоянным напряжением. Подключение ПЭВМ к блоку питания происходит через сетевой кабель. В составе «Спрут-6М» также есть соединительный и интерфейсный кабели для высокоскоростной передачи информации и кабель питания от сети 220 Вт.</html>",
    "slide1H6": "<html>Блок измерительный «Спрут» Измеритель шума и вибраций 1-го класса точности, предназначен для сопряжения внешних источников маломощных электрических низкочастотных сигналов со встроенными в него устройствами аналогово-цифрового преобразования, проведения измерений, цифровой обработки полученных результатов измерений, их отображения и передачи полученных результатов в управляющую ПЭВМ.</html>",
    "slide1H7": "<html>Устройство сопряжения с измерительным модулем «S8W» Совместно с модулем сопряжения c ПК обеспечивают передачу данных между измерительным модулем и ПЭВМ и с помощью соединительного кабеля — адаптера SV-55, подключается к разъему USB-Host измерительного модуля.</html>",

    "slide2H1": "<html>Измерительный модуль с октавным анализом, третьоктавным анализом и функцией БЭПФ «Спрут-7А». Вместе с измерительным модулем в комплекте идет штатив для его установки. Измерительный модуль обеспечивает формирование питающих напряжений и токов, усиление маломощных электрических сигналов от датчиков, аналогово-цифровое преобразование и измерение, предварительную цифровую обработку и отображение результатов на собственном дисплее, их передачу в управляющую ПЭВМ в цифровом виде и проверку значений напряжения встроенного источника электропитания и индикацию его состояния.</html>",
    "slide2H2": "<html>Экранированная акустическая система, используемая при проведении измерений акустоэлектрических преобразований, в «Спрут-7А» модулем источника акустического сигнала является ультракомпактный ноутбук. Также в составе даны соединительный кабель для подключения модуля источника тестового акустического сигнала к акустической системе и стойка для установки акустической системы.</html>",
    "slide2H3": "<html>ПЭВМ, специализированно разработанная для дальнейшей работы на ней с соответствующей СПО для проведения измерений и управления комплексом. В комплекте также прилагается CD-диск со специальным программным обеспечением программно-аппаратного комплекса «Спрут-7А»</html>",
    "slide2H4": "<html>Антенна с рабочим диапазоном частот 0,2-5000 кГц, разработана для измерения напряженности магнитной составляющей синусоидальных, шумовых и импульсных радиопомех в лабораторных помещениях, экранированных камерах и на открытых площадках в комплекте с измерительными приемниками, анализаторами спектра, селективными микровольтметрами любого типа в задачах обеспечения электромагнитной совместимости радиоэлектронных средств, защиты информации.</html>",
    "slide2H5": "<html>Источник автономного питания предназначен для электропитания проверяемых устройств постоянным напряжением 12, 24, 36, 48 или 60 вольт и током до 200 мА, а также для обеспечения заряда встроенных в источник питания собственных аккумуляторов.</html>",
    "slide2H6": "<html>Измерительный усилитель № 1 «SZA 1-01» и измерительный усилитель № 2 «SZA2-01» с режекторным фильтром. Измерительные усилители предназначены для подключения к измерительному модулю различных источников низковольтных сигналов, в том числе измерительных антенн, пробников, осциллографических щупов, токосъемников и т.п. Подключаются усилители к измерительному модулю с помощью кабеля. Электропитание усилителей осуществляется от встроенных аккумуляторов. Зарядка встроенных аккумуляторов производится от входящего в комплект зарядного устройства. Также в комплекс входит комплект щупов, тройник BNC и заглушка 50 Ом для усилителя.</html>",
    "slide2H7": "<html>Устройство сопряжения с измерительным модулем «SZPCC-04» с антенной представляет собой внешний радиомодем и совместно с модулем сопряжения c ПК обеспечивают передачу данных между измерительным модулем и ПЭВМ. Подключается помощью соединительного кабеля - адаптера SV-55 к разъему USB-Host измерительного модуля.</html>",
    "slide2H8": "<html>Измерительный микрофон - Микрофон является датчиком, предназначенным для измерения уровней акустических сигналов. Он подключается к измерительному модулю при помощи специального кабеля. В комплект измерительного микрофона входят микрофон «SV22» и микрофонный предусилитель «SV12L».</html>",

    "slide3H1": "<html>Измерительный токосъемник ТК-16М. Предназначен для измерения силы тока радиопомех в сетях электропитания, линиях связи, управления и передачи данных без разрыва электрических цепей в сочетании с измерительными приемниками и анализаторами спектра. ТК-16М является изделием неремонтируемым и соответствует по условиям эксплуатации группе 3 ГОСТ 22261-82. В комплекте «Колибри» токосъемник поставляется с кабелем.</html>",
    "slide3H2": "<html>Исполнительное устройство «Колибри-ИУ». Устройство контролируется дистанционно при помощи пульта ДУ2. Применяется для измерений уровней фона, акустических и виброакустических сигналов средств активной защиты.</html>",
    "slide3H3": "<html>Источник тестового акустического сигнала «АТ2». Генератор тестовых акустических сигналов «АТ2» предназначен для формирования тестового акустического сигнала типа «белый шум» высокого качества, а также излучения акустического сигнала, формируемого внешним источником. Вместе с генератором поставляется экранирующий короб «Матрешка», созданный для обеспечения повышенных экранирующих свойств генератора по электрической и магнитной составляющей электромагнитного поля, пульт дистанционного управления «АТ2» и тренога с переходником для крепления генератора.</html>",
    "slide3H4": "<html>Пульт дистанционного управления и брелок «Колибри-МДУ1» и брелок – пульт управления ДУ, предназначены для дистанционного управления анализатором посредством приема их команд внешней антенной, которая подключается к нему заранее через разъем «Антенна». Модуль дистанционного управления «Колибри-МДУ1» подключается к анализатору и работает под его управлением в автоматическом режиме – в зависимости от измеряемого параметра осуществляет включение/выключение дистанционно управляемого генератора шума «КОЛИБРИ-АТ1». В ручном режиме включение/выключение генератора осуществляется с помощью брелока.</html>",
    "slide3H5": "<html>Измерительный микрофон «MP201» с предусилителем «P410» Микрофон является преполяризованным микрофоном свободного поля. Номинальная чувствительность микрофона – 50 мВ/Па, частотный диапазон 6,3 – 20000 Гц, а максимально измеряемый уровень звукового давления 146 дБ. Часто используется для измерений шумомерами класса 1. Микрофон вместе с предусилитель подключается к анализатору. В состав также входит штатив с держателем для микрофона.</html>",
    "slide3H6": "<html>Многоканальный анализатор-концентратор сигналов «СКМ-8». Предназначен для проведения измерений параметров вероятных технических каналов утечки информации, а также расчёта показателей оценки эффективности защиты речевой информации. Изделие может применяться совместно с ПЭВМ для формирования отчетов и повышения качественного уровня визуализации информации.</html>",
    "slide3H7": "<html>Компакт-диск (Flash-накопитель) с программным обеспечением «СКМ-8 ПО» и «Колибри ПО». «СКМ-8 ПО» устанавливается в ПЭВМ на базе операционной системы «MS Windows-XP» («Vista»). Формируемые в задачах выходные отчеты представляются в формате *.rtf или *.db8. Для работы с ПЭВМ комплекс «Колибри» должен быть подключен к свободному разъему USB порта ПЭВМ с использованием кабеля. «Колибри ПО» расширяет функциональные возможности комплекса «Колибри», что обеспечивает проведение спектрального (узкополосного) анализа в полосе до 1,5 Гц любым из измерительных каналов комплекса, проведение оценки эффективности защиты речевой информации от утечки за счет АЭП в элементах ВТСС для различных типов линий ВТСС, измерение уровней акустического теста, фона, сигнала и фона.</html>",
    "slide3H8": "<html>Измерительный акселерометр АР2098 -100. Вибропреобразователь предназначен для преобразования механических колебаний контролируемого объекта в электрический сигнал, пропорциональный вибрационному или ударному ускорению механической системы. Принцип его действия основан на генерации электрического сигнала, пропорционального воздействующему ускорению. Вместе с ним в комплекте поставляется кабель для подключения акселерометра к анализатору.</html>",

    "slide4H1": "<html>Источник шумового сигнала, выполненный на резисторе</html>",
    "slide4H2": "<html>Повышает сигнал до уровня напряжения линейного входа</html>",
    "slide4H3": "<html>Пассивное сверхвысокочастотное устройство, которое изменяет и исправляет спектральные плотности сигнала</html>",
    "slide4H4": "<html>Маломощный генератор электрических колебаний, применяемый для преобразования частот сигнала, а данном случае источник опорного сигнала для перемножения</html>",
    "slide4H5": "<html>Переводит сигнал из области звуковых частот в радиочастоты</html>",
    "slide4H6": "<html>Усиливает мощность сигнала для его перенаправления на акустический излучатель</html>"
  },
  "ru.midoritroop.frames.HelpFrame": {
    "slide1Name": "Справка",
    "desc1": "<html>Для создания этой программы использовались данные из открытых источников, научной литературы, официальных сайтов производителей оборудования.</html>",
    "desc2": "<html>Литература по автоматизированному комплексу для проведения акустических и виброакустических измерений «ШЕПОТ»:</html>",
    "btn1": "<html>Формуляр (PDF rus)</html>",
    "btn2": "<html>Учебно-методическое пособие (PDF rus)</html>",
    "btn3": "<html>Руководство по эксплуатации измерителя шумовых помех «Larson&Davis 824» (PDF eng)</html>"

  },
  "paths": {
    "Logo.png": ".\\src\\main\\resources\\global\\Logo.png",
    "shepot.png": ".\\src\\main\\resources\\mainmenu\\shepot.png",
    "AcousticStruct.png": ".\\src\\main\\resources\\struct\\AcousticStruct.png",
    "AcousticStruct2.png": ".\\src\\main\\resources\\struct\\AcousticStruct2.png",
    "ArrowNextPRPL.png": ".\\src\\main\\resources\\struct\\ArrowNextPRPL.png",
    "ArrowBackPRPL.png": ".\\src\\main\\resources\\struct\\ArrowBackPRPL.png",
    "ArrowReturnPRPL.png": ".\\src\\main\\resources\\struct\\ArrowReturnPRPL.png",
    "GeneratorStruct.png": ".\\src\\main\\resources\\struct\\GeneratorStruct.png",
    "MainStruct.png": ".\\src\\main\\resources\\struct\\MainStruct.png",
    "MeasuringToolStruct.png": ".\\src\\main\\resources\\struct\\MeasuringToolStruct.png",
    "MicroStruct.png": ".\\src\\main\\resources\\struct\\MicroStruct.png",
    "f.pdf": ".\\src\\main\\resources\\help\\f.pdf",
    "y.pdf": ".\\src\\main\\resources\\help\\y.pdf",
    "l.pdf": ".\\src\\main\\resources\\help\\l.pdf",
    "Sprut-6ma.png": ".\\src\\main\\resources\\review\\Sprut-6ma.png",
    "Sprut-7A.png": ".\\src\\main\\resources\\review\\Sprut-7A.png",
    "Calibri.png": ".\\src\\main\\resources\\review\\Calibri.png"
  }
}